Revit 2017 API
AssetPropertyInteger Class
 Represents a property of integer value.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyInteger : AssetProperty
Visual Basic
Public Class AssetPropertyInteger _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyInteger : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyInteger
See Also
AssetPropertyInteger Members
Autodesk.Revit.Utility Namespace